"use client";

import React from "react";
import Image from "next/image";

const BlobImage = () => {
  return (
    <div
      id="about-me"
      dir="rtl"
      className="relative flex flex-col md:flex-row items-center overflow-hidden w-full min-h-screen px-4 md:px-12 py-12"
    >
      <div className="relative w-full md:w-[50%] h-[400px] md:h-[600px] mb-10 md:mb-0 order-1 md:order-2">
        <svg
          className="absolute top-0 left-0 w-full h-full"
          viewBox="0 0 405 405"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M202.5,380.4430135685834C226.39253461802244,385.4957955265634,247.46091777204836,362.1792467185125,267.1791834238087,347.7718244759704C284.78442766499785,334.9083104151761,296.76399103502564,316.7125354085024,311.5960243538856,300.7305015450542C326.62438257974355,284.53692073828233,349.27987148231534,273.41839523665834,355.77833111899264,252.30314878626993C362.28120538804757,231.17355800570903,351.79770059179623,208.82635890782996,346.48508005840995,187.36655827079366C341.64583897254045,167.81892668583635,337.0520625909023,148.01573743021757,325.82253550920905,131.29970092661102C314.87590920469376,115.00478453641647,299.3197009323337,102.53647684136075,282.5941461231664,92.25986534049743C266.49708100235245,82.36941408562883,246.74062001285873,81.50845513691354,230.13137744792604,72.50458969212346C207.04091813213833,59.98725857813868,191.62567579487077,32.25633641452073,165.5851591791365,28.829328387561066C140.50720821032672,25.528996810503042,111.76207434819227,35.669016692739234,95.14618038741244,54.74014359171073C77.97845926635503,74.44463790532713,90.7239101623515,107.79334693115409,77.26760798351961,130.19704475802422C63.48589853996375,153.14252040265268,26.514052291542768,157.72264067063784,18.041961257533785,183.11267889936644C9.962961160026644,207.32466157308693,18.965679682947908,237.05484541083126,34.97939086807595,256.9307454318961C51.340781346961805,277.23817808160874,82.0664578330286,277.5617499712679,104.64798310137532,290.6063517582221C120.62481179459114,299.83563833850116,135.36104459483144,310.29106158815637,148.95264362166625,322.76933157109175C168.49026611232543,340.7065682260117,176.55103885143325,374.9553394973318,202.5,380.4430135685834"
            fill="#1E3A8A"
          />
        </svg>
        <div className="absolute top-1/2 left-1/2 transform -translate-x-1/2 -translate-y-1/2 w-[200px] h-[200px] sm:w-40 sm:h-40 md:w-48 md:h-48 overflow-hidden shadow-lg rounded-full">
          <Image
            src="/img/images.pg"
            alt="Your profile"
            fill
            className="object-cover"
          />
        </div>
      </div>

      {/* بخش متن */}
      <div className="flex flex-col w-full md:w-[55%] md:px-24 text-justify items-center justify-start order-2 md:order-1">
        <div className="flex flex-col justify-center items-center w-full md:w-[300px] h-[100px]">
          <h1 className="text-2xl font-bold">درباره من</h1>
          <div className="h-[2px] w-[200px] bg-[#1E3A8A]"></div>
        </div>

        <h2 className="mt-10 text-[16px] md:text-[20px] leading-8 md:leading-9">
          اینجانب آناهیتا شمس، طراح و توسعه‌دهنده وب‌سایت، با تمرکز بر ارائه
          راهکارهای نوآورانه و تخصصی در حوزه طراحی و پیاده‌سازی وب‌سایت‌های
          شرکتی، فروشگاهی و شخصی فعالیت می‌کنم.
          <br />
          برند آناتک با هدف ارتقاء سطح کیفی حضور آنلاین کسب‌وکارها ایجاد شده و
          در راستای طراحی رابط‌های کاربری جذاب، توسعه ساختارهای فنی بهینه و
          ایجاد تجربه کاربری مؤثر، خدمات خود را ارائه می‌دهد.
          <br />
          تعهد به دقت در جزئیات، بهره‌گیری از فناوری‌های روز و درک عمیق نیازهای
          هر مشتری، از اصول کلیدی در فرآیند همکاری با کارفرمایان گرامی می‌باشد.
          در آناتک طراحی وب‌سایت صرفاً یک فرآیند فنی نیست؛ بلکه تلفیقی‌ست از
          هنر، تخصص و استراتژی که منجر به خلق بستری قدرتمند برای معرفی، توسعه و
          رشد کسب‌وکار شما می‌گردد.
          <br />
          هدف من ارائه خدماتی مبتنی بر اعتماد، کیفیت و اثربخشی است تا وب‌سایت
          شما فراتر از یک حضور دیجیتال ساده، به ابزاری برای موفقیت تبدیل شود.
        </h2>
      </div>
    </div>
  );
};

export default BlobImage;
